modm-ext/data.modm.io/docs/svd/header_stm32wl55xx.svd
        <register>
          <name>C2IMR1</name>
          <description>SYSCFG CPU2 (CORTEX M0) interrupt masks control-status register part 1</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTCSTAMPTAMPLSECSSIM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCALARMIM</name>
              <description>Enabling of interrupt from RTC Alarms to CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSSRUIM</name>
              <description>Enabling of interrupt from RTC SSRU to CPU2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCWKUPIM</name>
              <description>Enabling of interrupt from RTC Wakeup to CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCIM</name>
              <description>Enabling of interrupt from RCC to CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHIM</name>
              <description>Enabling of interrupt from FLASH to CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAIM</name>
              <description>Enabling of interrupt from PKA to CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AESIM</name>
              <description>Enabling of interrupt from AES to CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPIM</name>
              <description>Enabling of interrupt from Comparator to CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIM</name>
              <description>Enabling of interrupt from Analog Digital Converter to CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACIM</name>
              <description>Enabling of interrupt from Digital Analog Converter to CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI0IM</name>
              <description>Enabling of interrupt from External Interrupt Line 0 to CPU2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI1IM</name>
              <description>Enabling of interrupt from External Interrupt Line 1 to CPU2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI2IM</name>
              <description>Enabling of interrupt from External Interrupt Line 2 to CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI3IM</name>
              <description>Enabling of interrupt from External Interrupt Line 3 to CPU2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI4IM</name>
              <description>Enabling of interrupt from External Interrupt Line 4 to CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5IM</name>
              <description>Enabling of interrupt from External Interrupt Line 5 to CPU2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6IM</name>
              <description>Enabling of interrupt from External Interrupt Line 6 to CPU2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7IM</name>
              <description>Enabling of interrupt from External Interrupt Line 7 to CPU2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8IM</name>
              <description>Enabling of interrupt from External Interrupt Line 8 to CPU2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9IM</name>
              <description>Enabling of interrupt from External Interrupt Line 9 to CPU2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10IM</name>
              <description>Enabling of interrupt from External Interrupt Line 10 to CPU2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11IM</name>
              <description>Enabling of interrupt from External Interrupt Line 11 to CPU2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12IM</name>
              <description>Enabling of interrupt from External Interrupt Line 12 to CPU2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13IM</name>
              <description>Enabling of interrupt from External Interrupt Line 13 to CPU2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14IM</name>
              <description>Enabling of interrupt from External Interrupt Line 14 to CPU2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI15IM</name>
              <description>Enabling of interrupt from External Interrupt Line 15 to CPU2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2IMR2</name>
          <description>SYSCFG CPU2 (CORTEX M0) interrupt masks control-status register part 2</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA1CH1IM</name>
              <description>Enabling of interrupt from DMA1 Channel 1 to CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH2IM</name>
              <description>Enabling of interrupt from DMA1 Channel 2 to CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH3IM</name>
              <description>Enabling of interrupt from DMA1 Channel 3 to CPU2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH4IM</name>
              <description>Enabling of interrupt from DMA1 Channel 4 to CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH5IM</name>
              <description>Enabling of interrupt from DMA1 Channel 5 to CPU2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH6IM</name>
              <description>Enabling of interrupt from DMA1 Channel 6 to CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH7IM</name>
              <description>Enabling of interrupt from DMA1 Channel 7 to CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH1IM</name>
              <description>Enabling of interrupt from DMA2 Channel 1 to CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH2IM</name>
              <description>Enabling of interrupt from DMA2 Channel 2 to CPU2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH3IM</name>
              <description>Enabling of interrupt from DMA2 Channel 3 to CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH4IM</name>
              <description>Enabling of interrupt from DMA2 Channel 4 to CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH5IM</name>
              <description>Enabling of interrupt from DMA2 Channel 5 to CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH6IM</name>
              <description>Enabling of interrupt from DMA2 Channel 6 to CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH7IM</name>
              <description>Enabling of interrupt from DMA2 Channel 7 to CPU2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUX1IM</name>
              <description>Enabling of interrupt from DMAMUX1 to CPU2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM3IM</name>
              <description>Enabling of interrupt from Power Voltage Monitoring 3 to CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDIM</name>
              <description>Enabling of interrupt from Power Voltage Detector to CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RFDCR</name>
          <description>SYSCFG CPU2 radio debug control register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RFTBSEL</name>
              <description>Radio debug test bus selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANALOG_TEST_BUS</name>
                  <description>Analog test bus selected on RF_ADTB[3:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_TEST_BUS</name>
                  <description>Digital test bus selected on RF_ADTB[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
