modm-ext/data.modm.io/docs/svd/header_stm32wl55xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM1</name>
      <description>TIM</description>
      <baseAddress>0x40012c00</baseAddress>
      <interrupt>
        <name>TIM1_BRK</name>
        <description>TIM1 Break Interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIM1_UP</name>
        <description>TIM1 Update Interrupt</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>TIM1_TRG_COM</name>
        <description>TIM1 Trigger and Communication Interrupts</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>TIM1_CC</name>
        <description>TIM1 Capture Compare Interrupt</description>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>TIM control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CEN</name>
              <description>Counter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDIS</name>
              <description>Update disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>URS</name>
              <description>Update request source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>Counter overflow/underflow, Setting the UG bit or Update generation through the slave mode controller generates an update request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER</name>
                  <description>Only counter overflow/underflow generates an update request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPM</name>
              <description>One pulse mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Counter stops counting at the next update event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPETITIVE</name>
                  <description>Counter is not stopped at update event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Timer counter counts up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Timer counter counts down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMS</name>
              <description>CMS[1:0] bits (Center-aligned mode selection)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ARPE</name>
              <description>Auto-reload preload enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKD</name>
              <description>CKD[1:0] bits (clock division)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>tDTS=tCK_INT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>tDTS=2*tCK_INT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>tDTS=4*tCK_INT</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UIFREMAP</name>
              <description>Update interrupt flag remap</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>TIM control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CCPC</name>
              <description>Capture/Compare Preloaded Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCUS</name>
              <description>Capture/Compare Control Update Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONLY</name>
                  <description>Capture/compare control bits are updated by setting the COMG bit only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AND_TRGI</name>
                  <description>Capture/compare control bits are updated by setting the COMG bit or when a rising edge occurs on trigger input (TRGI)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCDS</name>
              <description>Capture/Compare DMA Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CC</name>
                  <description>CCx DMA request sent when CCx event occurs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>CCx DMA requests sent when update event occurs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMS</name>
              <description>MMS[2:0] bits (Master Mode Selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>UG bit from the TIMx_EGR register is used as trigger output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Counter Enable signal (CNT_EN) is used as trigger output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Update event is used as trigger output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1IF</name>
                  <description>CC1 capture or a compare match is used as trigger output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC1REF</name>
                  <description>OC1REF signal is used as trigger output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC2REF</name>
                  <description>OC2REF signal is used as trigger output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC3REF</name>
                  <description>OC3REF signal is used as trigger output</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC4REF</name>
                  <description>OC4REF signal is used as trigger output</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TI1S</name>
              <description>TI1 Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS1</name>
              <description>Output Idle state 1 (OC1 output)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS1N</name>
              <description>Output Idle state 1 (OC1N output)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS2</name>
              <description>Output Idle state 2 (OC2 output)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS2N</name>
              <description>Output Idle state 2 (OC2N output)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS3</name>
              <description>Output Idle state 3 (OC3 output)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS3N</name>
              <description>Output Idle state 3 (OC3N output)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS4</name>
              <description>Output Idle state 4 (OC4 output)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS5</name>
              <description>Output Idle state 5 (OC5 output)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OIS6</name>
              <description>Output Idle state 6 (OC6 output)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMS2</name>
              <description>MMS[2:0] bits (Master Mode Selection)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>UG bit from the TIMx_EGR register is used as trigger output 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Counter Enable signal (CNT_EN) is used as trigger output 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Update event is used as trigger output 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1F</name>
                  <description>CC1 capture or a compare match is used as trigger output 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC1</name>
                  <description>OC1REF signal is used as trigger output 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC2</name>
                  <description>OC2REF signal is used as trigger output 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC3</name>
                  <description>OC3REF signal is used as trigger output 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC4</name>
                  <description>OC4REF signal is used as trigger output 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC5</name>
                  <description>OC5REF signal is used as trigger output 2</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC6</name>
                  <description>OC6REF signal is used as trigger output 2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC4_RISINGFALLING</name>
                  <description>OC4REF rising or falling edges are used as trigger output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC6_RISINGFALLING</name>
                  <description>OC6REF rising or falling edges are used as trigger output 2</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC4_RISING_OC6_RISING</name>
                  <description>OC4REF or OC6REF rising edges are used as trigger output 2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC4_RISING_OC6_FALLING</name>
                  <description>OC4REF rising or OC6REF falling edges are used as trigger output 2</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC5_RISING_OC6_RISING</name>
                  <description>OC5REF or OC6REF rising edges are used as trigger output 2</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OC5_RISING_OC6_FALLING</name>
                  <description>OC5REF rising or OC6REF falling edges are used as trigger output 2</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>TIM slave mode control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMS</name>
              <description>SMS[2:0] bits (Slave mode selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OCCS</name>
              <description>OCREF clear selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCREF_CLR</name>
                  <description>OCREF_CLR_INT is connected to the OCREF_CLR input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETR</name>
                  <description>OCREF_CLR_INT is connected to ETRF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS</name>
              <description>TS[2:0] bits (Trigger selection)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSM</name>
              <description>Master/slave mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETF</name>
              <description>ETF[3:0] bits (External trigger filter)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ETPS</name>
              <description>ETPS[1:0] bits (External trigger prescaler)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ECE</name>
              <description>External clock enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETP</name>
              <description>External trigger polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMS_3</name>
              <description>SMS[2:0] bits (Slave mode selection)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS_3</name>
              <description>TS[2:0] bits (Trigger selection)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>TIM DMA/interrupt enable register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IE</name>
              <description>Capture/Compare 1 interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IE</name>
              <description>Capture/Compare 2 interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3IE</name>
              <description>Capture/Compare 3 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC4IE</name>
              <description>Capture/Compare 4 interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMIE</name>
              <description>COM interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIE</name>
              <description>Trigger interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIE</name>
              <description>Break interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDE</name>
              <description>Update DMA request enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1DE</name>
              <description>Capture/Compare 1 DMA request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2DE</name>
              <description>Capture/Compare 2 DMA request enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3DE</name>
              <description>Capture/Compare 3 DMA request enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC4DE</name>
              <description>Capture/Compare 4 DMA request enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMDE</name>
              <description>COM DMA request enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDE</name>
              <description>Trigger DMA request enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
